fio-test/results/seq_read_out_conv/64k-psync-3.out
job1: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=31614: Fri Aug 30 20:00:21 2024
  read: IOPS=18.0k, BW=1122MiB/s (1177MB/s)(673GiB/614266msec)
    clat (usec): min=39, max=1318, avg=430.24, stdev=96.14
     lat (usec): min=39, max=1318, avg=431.05, stdev=96.33
    clat percentiles (usec):
     |  1.00th=[  190],  5.00th=[  227], 10.00th=[  310], 20.00th=[  347],
     | 30.00th=[  367], 40.00th=[  420], 50.00th=[  482], 60.00th=[  490],
     | 70.00th=[  498], 80.00th=[  502], 90.00th=[  515], 95.00th=[  529],
     | 99.00th=[  570], 99.50th=[  594], 99.90th=[  693], 99.95th=[  734],
     | 99.99th=[  857]
   bw (  MiB/s): min= 1108, max= 2325, per=100.00%, avg=1138.96, stdev= 9.28, samples=9691
   iops        : min=17736, max=37209, avg=18221.63, stdev=148.51, samples=9691
  lat (usec)   : 50=0.01%, 100=0.08%, 250=6.82%, 500=63.89%, 750=29.16%
  lat (usec)   : 1000=0.03%
  lat (msec)   : 2=0.01%
  cpu          : usr=4.01%, sys=13.27%, ctx=11028710, majf=0, minf=258
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=11028480,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1122MiB/s (1177MB/s), 1122MiB/s-1122MiB/s (1177MB/s-1177MB/s), io=673GiB (723GB), run=614266-614266msec

Disk stats (read/write):
    dm-0: ios=11025719/0, merge=0/0, ticks=3781672/0, in_queue=3781672, util=100.00%, aggrios=1102848/0, aggrmerge=0/0, aggrticks=415387/0, aggrin_queue=415387, aggrutil=100.00%
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme3n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme1n2: ios=2205696/0, merge=0/0, ticks=831376/0, in_queue=831376, util=100.00%
  nvme4n2: ios=2205696/0, merge=0/0, ticks=826381/0, in_queue=826381, util=100.00%
  nvme2n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme0n2: ios=2205696/0, merge=0/0, ticks=806124/0, in_queue=806124, util=100.00%
  nvme3n2: ios=2205696/0, merge=0/0, ticks=844484/0, in_queue=844484, util=100.00%
  nvme1n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme4n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n2: ios=2205696/0, merge=0/0, ticks=845510/0, in_queue=845509, util=100.00%